---
type: LayoutRuleClearSpacing
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# LayoutRuleClearSpacing

`Autodesk.Revit.DB.LayoutRuleClearSpacing` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | LayoutRuleClearSpacing | — | `public LayoutRuleClearSpacing ( double spacing , BeamSystemJustifyType justifyType )` |
| Property | JustifyType | — | `public BeamSystemJustifyType JustifyType { get ; set ; }` |
| Property | Spacing | — | `public double Spacing { get ; set ; }` |